HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEth_regdef.h
/** \\brief  Register 1 - MAC Frame Filter */
typedef struct _Ifx_ETH_MAC_FRAME_FILTER_Bits
{
    unsigned int PR:1;                      /**< \brief [0:0] Promiscuous Mode (rw) */
    unsigned int HUC:1;                     /**< \brief [1:1] Hash Unicast (rw) */
    unsigned int HMC:1;                     /**< \brief [2:2] Hash Multicast (rw) */
    unsigned int DAIF:1;                    /**< \brief [3:3] DA Inverse Filtering (rw) */
    unsigned int PM:1;                      /**< \brief [4:4] Pass All Multicast (rw) */
    unsigned int DBF:1;                     /**< \brief [5:5] Disable Broadcast Frames (rw) */
    unsigned int PCF:2;                     /**< \brief [7:6] Pass Control Frames (rw) */
    unsigned int SAIF:1;                    /**< \brief [8:8] SA Inverse Filtering (rw) */
    unsigned int SAF:1;                     /**< \brief [9:9] Source Address Filter Enable (rw) */
    unsigned int HPF:1;                     /**< \brief [10:10] Hash or Perfect Filter (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int VTFE:1;                    /**< \brief [16:16] VLAN Tag Filter Enable (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int IPFE:1;                    /**< \brief [20:20] Layer 3 and Layer 4 Filter Enable (r) */
    unsigned int DNTU:1;                    /**< \brief [21:21] Drop non-TCP/UDP over IP Frames (r) */
    unsigned int reserved_22:9;             /**< \brief \internal Reserved */
    unsigned int RA:1;                      /**< \brief [31:31] Receive All (rw) */
} Ifx_ETH_MAC_FRAME_FILTER_Bits;

/** \\brief  Register 8 - Missed Frame and Buffer Overflow Counter Register */
typedef struct _Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits
{
    unsigned int MISFRMCNT:16;              /**< \brief [15:0] MISFRMCNT (r) */
    unsigned int MISCNTOVF:1;               /**< \brief [16:16] MISCNTOVF (r) */
    unsigned int OVFFRMCNT:11;              /**< \brief [27:17] OVFFRMCNT (r) */
    unsigned int OVFCNTOVF:1;               /**< \brief [28:28] OVFCNTOVF (r) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits;

/** \\brief  Register 64 - MMC Control Register */
typedef struct _Ifx_ETH_MMC_CONTROL_Bits
{
    unsigned int CNTRST:1;                  /**< \brief [0:0] Counters Reset (rw) */
    unsigned int CNTSTOPRO:1;               /**< \brief [1:1] Counters Stop Rollover (rw) */
    unsigned int RSTONRD:1;                 /**< \brief [2:2] Reset on Read (rw) */
    unsigned int CNTFREEZ:1;                /**< \brief [3:3] MMC Counter Freeze (rw) */
    unsigned int CNTPRST:1;                 /**< \brief [4:4] Counters Preset (rw) */
    unsigned int CNTPRSTLVL:1;              /**< \brief [5:5] Full-Half Preset (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int UCDBC:1;                   /**< \brief [8:8] Update MMC Counters for Dropped Broadcast Frames (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_CONTROL_Bits;

/** \\brief  Register 130 - MMC Receive Checksum Offload Interrupt Register */
typedef struct _Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits
{
    unsigned int RXIPV4GFIS:1;              /**< \brief [0:0] MMC Receive IPV4 Good Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4HERFIS:1;            /**< \brief [1:1] MMC Receive IPV4 Header Error Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4NOPAYFIS:1;          /**< \brief [2:2] MMC Receive IPV4 No Payload Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4FRAGFIS:1;           /**< \brief [3:3] MMC Receive IPV4 Fragmented Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4UDSBLFIS:1;          /**< \brief [4:4] MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6GFIS:1;              /**< \brief [5:5] MMC Receive IPV6 Good Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6HERFIS:1;            /**< \brief [6:6] MMC Receive IPV6 Header Error Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6NOPAYFIS:1;          /**< \brief [7:7] MMC Receive IPV6 No Payload Frame Counter Interrupt Status (r) */
    unsigned int RXUDPGFIS:1;               /**< \brief [8:8] MMC Receive UDP Good Frame Counter Interrupt Status (r) */
    unsigned int RXUDPERFIS:1;              /**< \brief [9:9] MMC Receive UDP Error Frame Counter Interrupt Status (r) */
    unsigned int RXTCPGFIS:1;               /**< \brief [10:10] MMC Receive TCP Good Frame Counter Interrupt Status (r) */
    unsigned int RXTCPERFIS:1;              /**< \brief [11:11] MMC Receive TCP Error Frame Counter Interrupt Status (r) */
    unsigned int RXICMPGFIS:1;              /**< \brief [12:12] MMC Receive ICMP Good Frame Counter Interrupt Status (r) */
    unsigned int RXICMPERFIS:1;             /**< \brief [13:13] MMC Receive ICMP Error Frame Counter Interrupt Status (r) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int RXIPV4GOIS:1;              /**< \brief [16:16] MMC Receive IPV4 Good Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4HEROIS:1;            /**< \brief [17:17] MMC Receive IPV4 Header Error Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4NOPAYOIS:1;          /**< \brief [18:18] MMC Receive IPV4 No Payload Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4FRAGOIS:1;           /**< \brief [19:19] MMC Receive IPV4 Fragmented Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4UDSBLOIS:1;          /**< \brief [20:20] MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6GOIS:1;              /**< \brief [21:21] MMC Receive IPV6 Good Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6HEROIS:1;            /**< \brief [22:22] MMC Receive IPV6 Header Error Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6NOPAYOIS:1;          /**< \brief [23:23] MMC Receive IPV6 No Payload Octet Counter Interrupt Status (r) */
    unsigned int RXUDPGOIS:1;               /**< \brief [24:24] MMC Receive UDP Good Octet Counter Interrupt Status (r) */
    unsigned int RXUDPEROIS:1;              /**< \brief [25:25] MMC Receive UDP Error Octet Counter Interrupt Status (r) */
    unsigned int RXTCPGOIS:1;               /**< \brief [26:26] MMC Receive TCP Good Octet Counter Interrupt Status (r) */
    unsigned int RXTCPEROIS:1;              /**< \brief [27:27] MMC Receive TCP Error Octet Counter Interrupt Status (r) */
    unsigned int RXICMPGOIS:1;              /**< \brief [28:28] MMC Receive ICMP Good Octet Counter Interrupt Status (r) */
    unsigned int RXICMPEROIS:1;             /**< \brief [29:29] MMC Receive ICMP Error Octet Counter Interrupt Status (r) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits;

/** \\brief  Register 128 - MMC Receive Checksum Offload Interrupt Mask Register */
typedef struct _Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits
{
    unsigned int RXIPV4GFIM:1;              /**< \brief [0:0] MMC Receive IPV4 Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4HERFIM:1;            /**< \brief [1:1] MMC Receive IPV4 Header Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4NOPAYFIM:1;          /**< \brief [2:2] MMC Receive IPV4 No Payload Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4FRAGFIM:1;           /**< \brief [3:3] MMC Receive IPV4 Fragmented Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4UDSBLFIM:1;          /**< \brief [4:4] MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6GFIM:1;              /**< \brief [5:5] MMC Receive IPV6 Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6HERFIM:1;            /**< \brief [6:6] MMC Receive IPV6 Header Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6NOPAYFIM:1;          /**< \brief [7:7] MMC Receive IPV6 No Payload Frame Counter Interrupt Mask (rw) */
    unsigned int RXUDPGFIM:1;               /**< \brief [8:8] MMC Receive UDP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXUDPERFIM:1;              /**< \brief [9:9] MMC Receive UDP Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXTCPGFIM:1;               /**< \brief [10:10] MMC Receive TCP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXTCPERFIM:1;              /**< \brief [11:11] MMC Receive TCP Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXICMPGFIM:1;              /**< \brief [12:12] MMC Receive ICMP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXICMPERFIM:1;             /**< \brief [13:13] MMC Receive ICMP Error Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int RXIPV4GOIM:1;              /**< \brief [16:16] MMC Receive IPV4 Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4HEROIM:1;            /**< \brief [17:17] MMC Receive IPV4 Header Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4NOPAYOIM:1;          /**< \brief [18:18] MMC Receive IPV4 No Payload Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4FRAGOIM:1;           /**< \brief [19:19] MMC Receive IPV4 Fragmented Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4UDSBLOIM:1;          /**< \brief [20:20] MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6GOIM:1;              /**< \brief [21:21] MMC Receive IPV6 Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6HEROIM:1;            /**< \brief [22:22] MMC Receive IPV6 Header Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6NOPAYOIM:1;          /**< \brief [23:23] MMC Receive IPV6 No Payload Octet Counter Interrupt Mask (rw) */
    unsigned int RXUDPGOIM:1;               /**< \brief [24:24] MMC Receive UDP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXUDPEROIM:1;              /**< \brief [25:25] MMC Receive UDP Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXTCPGOIM:1;               /**< \brief [26:26] MMC Receive TCP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXTCPEROIM:1;              /**< \brief [27:27] MMC Receive TCP Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXICMPGOIM:1;              /**< \brief [28:28] MMC Receive ICMP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXICMPEROIM:1;             /**< \brief [29:29] MMC Receive ICMP Error Octet Counter Interrupt Mask (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits;

