HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEth_regdef.h
/** \\brief  Register 133 - Receive IPV4 Header Error Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits
{
    unsigned int RXIPV4HDRERRFRM:32;        /**< \brief [31:0] RXIPV4HDRERRFRM (r) */
} Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits;

/** \\brief  Register 149 - Receive IPV4 Header Error Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits
{
    unsigned int RXIPV4HDRERROCT:32;        /**< \brief [31:0] This field indicates the number of bytes received in the IPv4 datagrams with header errors (checksum, length, or version mismatch). The value in the Length field of IPv4 header is used to update this counter. (r) */
} Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits;

/** \\brief  Register 134 - Receive IPV4 No Payload Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits
{
    unsigned int RXIPV4NOPAYFRM:32;         /**< \brief [31:0] RXIPV4NOPAYFRM (r) */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits;

/** \\brief  Register 150 - Receive IPV4 No Payload Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits
{
    unsigned int RXIPV4NOPAYOCT:32;         /**< \brief [31:0] This field indicates the number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits;

/** \\brief  Register 152 - Receive IPV4 Fragmented Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits
{
    unsigned int RXIPV4UDSBLOCT:32;         /**< \brief [31:0] RXIPV4UDSBLOCT (r) */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits;

/** \\brief  Register 136 - Receive IPV4 UDP Checksum Disabled Frame Counter
 * Register */
typedef struct _Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits
{
    unsigned int RXIPV4UDSBLFRM:32;         /**< \brief [31:0] RXIPV4UDSBLFRM (r) */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits;

/** \\brief  Register 137 - Receive IPV6 Good Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits
{
    unsigned int RXIPV6GDFRM:32;            /**< \brief [31:0] RXIPV6GDFRM (r) */
} Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits;

/** \\brief  Register 153 - Receive IPV6 Good Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits
{
    unsigned int RXIPV6GDOCT:32;            /**< \brief [31:0] Thsi field indicates the number of bytes received in good IPv6 datagrams encapsulating TCP, UDP or ICMPv6 data. (r) */
} Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits;

/** \\brief  Register 138 - Receive IPV6 Header Error Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits
{
    unsigned int RXIPV6HDRERRFRM:32;        /**< \brief [31:0] RXIPV6HDRERRFRM (r) */
} Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits;

/** \\brief  Register 154 - Receive IPV6 Header Error Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits
{
    unsigned int RXIPV6HDRERROCT:32;        /**< \brief [31:0] This field indicates the number of bytes received in IPv6 datagrams with header errors (length or version mismatch). The value in the IPv6 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits;

/** \\brief  Register 139 - Receive IPV6 No Payload Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits
{
    unsigned int RXIPV6NOPAYFRM:32;         /**< \brief [31:0] RXIPV6NOPAYFRM (r) */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits;

/** \\brief  Register 155 - Receive IPV6 No Payload Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits
{
    unsigned int RXIPV6NOPAYOCT:32;         /**< \brief [31:0] This field indicates the number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits;

/** \\brief  Register 143 - Receive TCP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXTCP_ERROR_FRAMES_Bits
{
    unsigned int RXTCPERRFRM:32;            /**< \brief [31:0] RXTCPERRFRM (r) */
} Ifx_ETH_RXTCP_ERROR_FRAMES_Bits;

/** \\brief  Register 159 - Receive TCP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXTCP_ERROR_OCTETS_Bits
{
    unsigned int RXTCPERROCT:32;            /**< \brief [31:0] RXTCPERROCT (r) */
} Ifx_ETH_RXTCP_ERROR_OCTETS_Bits;

/** \\brief  Register 142 - Receive TCP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXTCP_GOOD_FRAMES_Bits
{
    unsigned int RXTCPGDFRM:32;             /**< \brief [31:0] RXTCPGDFRM (r) */
} Ifx_ETH_RXTCP_GOOD_FRAMES_Bits;

/** \\brief  Register 158 - Receive TCP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXTCP_GOOD_OCTETS_Bits
{
    unsigned int RXTCPGDOCT:32;             /**< \brief [31:0] RXTCPGDOCT (r) */
} Ifx_ETH_RXTCP_GOOD_OCTETS_Bits;

/** \\brief  Register 141 - Receive UDP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXUDP_ERROR_FRAMES_Bits
{
    unsigned int RXUDPERRFRM:32;            /**< \brief [31:0] RXUDPERRFRM (r) */
} Ifx_ETH_RXUDP_ERROR_FRAMES_Bits;

/** \\brief  Register 157 - Receive UDP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_ERROR_OCTETS_Bits
{
    unsigned int RXUDPERROCT:32;            /**< \brief [31:0] RXUDPERROCT (r) */
} Ifx_ETH_RXUDP_ERROR_OCTETS_Bits;

/** \\brief  Register 140 - Receive UDP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_FRAMES_Bits
{
    unsigned int RXUDPGDFRM:32;             /**< \brief [31:0] RXUDPGDFRM (r) */
} Ifx_ETH_RXUDP_GOOD_FRAMES_Bits;

/** \\brief  Register 156 - Receive UDP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_OCTETS_Bits
{
    unsigned int RXUDPGDOCT:32;             /**< \brief [31:0] RXUDPGDOCT (r) */
} Ifx_ETH_RXUDP_GOOD_OCTETS_Bits;

/** \\brief  Register 5 - Status Register */
typedef struct _Ifx_ETH_STATUS_Bits
{
    unsigned int TI:1;                      /**< \brief [0:0] Transmit Interrupt (rw) */
    unsigned int TPS:1;                     /**< \brief [1:1] Transmit Process Stopped (rw) */
    unsigned int TU:1;                      /**< \brief [2:2] Transmit Buffer Unavailable (rw) */
    unsigned int TJT:1;                     /**< \brief [3:3] Transmit Jabber Timeout (rw) */
    unsigned int OVF:1;                     /**< \brief [4:4] Receive Overflow (rw) */
    unsigned int UNF:1;                     /**< \brief [5:5] Transmit Underflow (rw) */
    unsigned int RI:1;                      /**< \brief [6:6] Receive Interrupt (rw) */
    unsigned int RU:1;                      /**< \brief [7:7] Receive Buffer Unavailable (rw) */
    unsigned int RPS:1;                     /**< \brief [8:8] Receive Process Stopped (rw) */
    unsigned int RWT:1;                     /**< \brief [9:9] Receive Watchdog Timeout (rw) */
    unsigned int ETI:1;                     /**< \brief [10:10] Early Transmit Interrupt (rw) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int FBI:1;                     /**< \brief [13:13] Fatal Bus Error Interrupt (rw) */
    unsigned int ERI:1;                     /**< \brief [14:14] Early Receive Interrupt (rw) */
    unsigned int AIS:1;                     /**< \brief [15:15] Abnormal Interrupt Summary (rw) */
    unsigned int NIS:1;                     /**< \brief [16:16] Normal Interrupt Summary (rw) */
    unsigned int RS:3;                      /**< \brief [19:17] Received Process State (r) */
    unsigned int TS:3;                      /**< \brief [22:20] Transmit Process State (r) */
    unsigned int EB:3;                      /**< \brief [25:23] Error Bits (r) */
    unsigned int GLI:1;                     /**< \brief [26:26] GMAC Line interface Interrupt (r) */
    unsigned int GMI:1;                     /**< \brief [27:27] GMAC MMC Interrupt (r) */
    unsigned int GPI:1;                     /**< \brief [28:28] GMAC PMT Interrupt (r) */
    unsigned int TTI:1;                     /**< \brief [29:29] Timestamp Trigger Interrupt (r) */
    unsigned int GLPII:1;                   /**< \brief [30:30] GMAC LPI Interrupt (for Channel 0) (r) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ETH_STATUS_Bits;

/** \\brief  Register 449 - Sub-Second Increment Register */
typedef struct _Ifx_ETH_SUB_SECOND_INCREMENT_Bits
{
    unsigned int SSINC:8;                   /**< \brief [7:0] Sub-second Increment Value (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_ETH_SUB_SECOND_INCREMENT_Bits;

/** \\brief  Register 457 - System Time - Higher Word Seconds Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits
{
    unsigned int TSHWR:16;                  /**< \brief [15:0] Timestamp Higher Word Register (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits;

/** \\brief  Register 451 - System Time - Nanoseconds Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits
{
    unsigned int TSSS:31;                   /**< \brief [30:0] Timestamp Sub Seconds (r) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits;

/** \\brief  Register 453 - System Time - Nanoseconds Update Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits
{
    unsigned int TSSS:31;                   /**< \brief [30:0] Timestamp Sub Second (rw) */
    unsigned int ADDSUB:1;                  /**< \brief [31:31] Add or subtract time (rw) */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits;

